<template>
  <ve-line :data="chartData" :settings="chartSettings"></ve-line>
</template>

<script>
  export default {
    data () {
      // this.chartSettings = {
      //   axisSite: { right: ['停留时长'] },
      //   yAxisType: ['KMB', 'KMB'],
      //   yAxisName: ['数值', '数值']
      // }
      return {
        chartSettings: {
        axisSite: { right: ['停留时长'] },
        yAxisType: ['KMB', 'KMB'],
        yAxisName: ['数值', '数值']
      },
        chartData: {
          columns: ['时间', '操作次数', '停留时长'],
          rows: [
            { '时间': '1', '操作次数': 14, '停留时长': 12 },
            { '时间': '3', '操作次数': 10, '停留时长': 12 },
            { '时间': '5', '操作次数': 12, '停留时长': 5 },
            { '时间': '7', '操作次数': 16, '停留时长': 7 },
            { '时间': '9', '操作次数': 14, '停留时长': 3 }
          ]
        },
        chartDatas: {
          columns: ['日期', '访问用户', '下单用户', '下单率'],
          rows: [
            { '日期': '1/1', '访问用户': 1393, '下单用户': 1093, '下单率': 0.32 },
            { '日期': '1/2', '访问用户': 3530, '下单用户': 3230, '下单率': 0.26 },
            { '日期': '1/3', '访问用户': 2923, '下单用户': 2623, '下单率': 0.76 },
            { '日期': '1/4', '访问用户': 1723, '下单用户': 1423, '下单率': 0.49 },
            { '日期': '1/5', '访问用户': 3792, '下单用户': 3492, '下单率': 0.323 },
            { '日期': '1/6', '访问用户': 4593, '下单用户': 4293, '下单率': 0.78 }
          ]
        }
      }
    }
  }
</script>